'''Прорешиваю задачи с семинара'''



# '''Задание №1
# ✔ Вручную создайте список с целыми числами, которые
# повторяются. Получите новый список, который содержит
# уникальные (без повтора) элементы исходного списка.
# ✔ *Подготовьте два решения, короткое и длинное, которое
# не использует другие коллекции помимо списков.'''
# list1 = [1, 2, 3, 5, 2, 2, 1, 13, 4, 2]
# list2 = []

# # Длинный способ
# for item in list1:
#     if item not in list2:
#         list2.append(item)

# print(list2)

# # Короткий способ
# list3 = list(set(list1))
# print(list3)



# '''Задание №2
# Пользователь вводит данные. Сделайте проверку данных
# и преобразуйте если возможно в один из вариантов ниже:
# ✔ Целое положительное число
# ✔ Вещественное положительное или отрицательное число
# ✔ Строку в нижнем регистре, если в строке есть
# хотя бы одна заглавная буква
# ✔ Строку в верхнем регистре в остальных случаях'''
# a = input("Введите что-нибудь: ")
# if a.isdecimal():
#     a1 = int(a)
# elif a.replace('.', '').replace('-', '').isdecimal():
#     a1 = float(a)
# elif not a.islower():
#     a1 = a.lower()
# else:
#     a1 = a.upper()

# print(f'{a1 = }   {type(a1)}')



# '''Задание №3
# ✔ Создайте вручную кортеж содержащий элементы разных типов.
# ✔ Получите из него словарь списков, где:
# ключ — тип элемента,
# значение — список элементов данного типа.'''
# my_tuple = (1, 1.23, "kdshkj", True, None, 45, 6.78, "oielirjg", False, -87)
# my_dict = {}

# for item in my_tuple:
#     # Добавляем новый тип, если его нет, с пустым списком;...
#     # ...и тут же в этот список (пустой или нет) добавляем значение
#     # переменная 'key' равна этому списку в словареи связана с ним
#     key = my_dict.setdefault(type(item), list())
#     key.append(item)

# print(my_dict)



# '''Задание №4
# ✔ Создайте вручную список с повторяющимися элементами.
# ✔ Удалите из него все элементы, которые встречаются дважды.'''
# list1 = [1, 2, 3, 5, 2, 2, 1, 13, 4, 2]

# for item in list1:
#     if list1.count(item) > 1:
#         for i in range(list1.count(item)):
#             list1.remove(item)

# print(list1)



# '''Задание №5
# ✔ Создайте вручную список с повторяющимися целыми числами.
# ✔ Сформируйте список с порядковыми номерами
# нечётных элементов исходного списка.
# ✔ Нумерация начинается с единицы.'''
# list1 = [1, 2, 3, 5, 2, 2, 1, 13, 4, 2, 1]
# list2 = []

# for i, item in enumerate(list1, start=1):
#     if item%2 != 0:
#         list2.append(i)

# print(list2)



# '''Задание №6
# Пользователь вводит строку текста. Вывести каждое слово с новой строки.
# ✔ Строки нумеруются начиная с единицы.
# ✔ Слова выводятся отсортированными согласно кодировки Unicode.
# ✔ Текст выравнивается по правому краю так, чтобы у самого длинного
# слова был один пробел между ним и номером строки.'''
# str_1 = input("Введите фразу: ").split()
# str_1.sort()
# temp = 0

# for item in str_1:
#     if len(item) > temp:
#         temp = len(item)

# for i, k in enumerate(str_1, start=1):
#     print(f'{i} {k:>{temp}}')



'''Задание №7
✔ Пользователь вводит строку текста.
✔ Подсчитайте сколько раз встречается
каждая буква в строке без использования
метода count и с ним.
✔ Результат сохраните в словаре, где ключ —
символ, а значение — частота встречи
символа в строке.
✔ Обратите внимание на порядок ключей.
Объясните почему они совпадают
или не совпадают в ваших решениях.'''



'''Задание №8
✔ Три друга взяли вещи в поход. Сформируйте
словарь, где ключ — имя друга, а значение —
кортеж вещей. Ответьте на вопросы:
✔ Какие вещи взяли все три друга
✔ Какие вещи уникальны, есть только у одного друга
✔ Какие вещи есть у всех друзей кроме одного
и имя того, у кого данная вещь отсутствует
✔ Для решения используйте операции
с множествами. Код должен расширяться
на любое большее количество друзей.'''



'''Домашнее задание:
✔ Решить задачи, которые не успели решить на семинаре.
✔ Дан список повторяющихся элементов. Вернуть список
с дублирующимися элементами. В результирующем списке
не должно быть дубликатов.
✔ В большой текстовой строке подсчитать количество встречаемых
слов и вернуть 10 самых частых. Не учитывать знаки препинания
и регистр символов. За основу возьмите любую статью
из википедии или из документации к языку.
✔ Создайте словарь со списком вещей для похода в качестве
ключа и их массой в качестве значения. Определите какие
вещи влезут в рюкзак передав его максимальную
грузоподъёмность. Достаточно вернуть один допустимый вариант.
✔ *Верните все возможные варианты комплектации рюкзака.'''