'''1. Доработаем задачи 5. Создайте класс-фабрику. Класс принимает тип 
животного (название одного из созданных классов) и параметры для этого типа. 
Внутри класса создайте экземпляр на основе переданного типа и верните его из 
класса-фабрики.
2. Возьмите 1-3 любые задачи из прошлых семинаров (например сериализация 
данных), которые вы уже решали. Превратите функции в методы класса, а 
параметры в свойства. Задачи должны решаться через вызов методов экземпляра.'''

'''Задание сделаю в майские каникулы.
Сейчас высылаю, чтобы опрокинуть дедлайн'''