'''1. Решить задачи, которые не успели решить на семинаре.
2. Напишите функцию группового переименования файлов. Она должна:
- принимать параметр желаемое конечное имя файлов. При переименовании в конце 
имени добавляется порядковый номер.
- принимать параметр количество цифр в порядковом номере.
- принимать параметр расширение исходного файла. Переименование должно работать 
только для этих файлов внутри каталога.
- принимать параметр расширение конечного файла.
- принимать диапазон сохраняемого оригинального имени. Например для диапазона 
[3, 6] берутся буквы с 3 по 6 из исходного имени файла. К ним прибавляется 
желаемое конечное имя, если оно передано. Далее счётчик файлов и расширение.
3. Соберите из созданных на уроке и в рамках домашнего задания функций пакет 
для работы с файлами.'''

'''1. Создать файл my_modul_07.py, в котором будет весь функционал ДЗ, и 
который будет в пакете. А в ЭТОМ файле только импорт и запуски.
2. создать функцию создания папки с набором тестовых файлов для ДЗ. Файлы 
создавать с именем из 8и случайных букв латиницы, расширение случайное из
заданного списка
3. Остальные пункты по заданию
4. Создать пакет "package7", в неи файл инит как в прошлом ДЗ, и спрятать в 
нем все датафайлы с семинара. Импортировать из ЭТОГО файла этот инит, далее 
вызывать функции по именам.'''

from package7.my_modul_07 import *

package_name = 'te_st_dir'
create_test_dir(package_name, ['txt','tmp','dat'], 15)
group_rename(package_name, '_target_', 3, 'tmp', 'wow', (3,6))
