"""Погружение в Python (семинары)
Урок 2. Простые типы данных
1. Напишите программу, которая получает целое число и возвращает его 
шестнадцатеричное строковое представление. Функцию hex используйте для 
проверки своего результата.
2. Напишите программу, которая принимает две строки вида “a/b” - дробь с 
числителем и знаменателем. Программа должна возвращать сумму и произведение* 
дробей. Для проверки своего кода используйте модуль fractions. Необязательное 
задание		"""



# Задача 1 (hex-число)
""" Лезем в гугл, находим алгоритм:
1. Делим десятичное число на 16 и записываем остаток от деления.
2. Результат деления вновь делим на 16 и опять записываем остаток.
3. Повторяем операцию до тех пор пока результат деления не будет равен нулю.
4. Запишем полученные остатки в обратном порядке и получим искомое число. """

num = original_num = int(input('Введи целое число: '))
hex_num = ""

while num > 0:
	dec_modulo = num % 16
	if dec_modulo == 15:
		hex_modulo = "f"
	elif dec_modulo == 14:
		hex_modulo = "e"
	elif dec_modulo == 13:
		hex_modulo = "d"
	elif dec_modulo == 12:
		hex_modulo = "c"
	elif dec_modulo == 11:
		hex_modulo = "b"
	elif dec_modulo == 10:
		hex_modulo = "a"
	else:
		hex_modulo = str(dec_modulo)
	hex_num = hex_modulo + hex_num
	num = num // 16
	print(num, dec_modulo)
	# if num == 0:
	# 	break

hex_num = "0x" + hex_num
print("Искомое шестнадцатеричное представление: " + hex_num)
print("Эталонное шестнадцатеричное представление: " + hex(original_num))
if hex_num == hex(original_num):
	print("Мы молодцы!")
