'''✔ Создайте словарь со списком вещей для похода в качестве
ключа и их массой в качестве значения. Определите какие
вещи влезут в рюкзак передав его максимальную
грузоподъёмность. Достаточно вернуть один допустимый вариант.
✔ *Верните все возможные варианты комплектации рюкзака.'''

# Руководствовался концепцией, что сначала ложим тяжелое, потом всё легче
# исходный словарь сформировал под это правило. "Звёздочку" делать не стал,
# нет идей как её реализовать.

dict1 = {"обувь":28, "одежда":27, "аптечка":26, "навигатор":25, "компас":24, \
        "карта":23, "палатка":22, "спальник":21, "каремат":20, "горелка":19, \
        "вода":18, "еда":17, "посуда ":16, "кружка":15, "ложка":14, \
        "миска":13, "нож":12, "мыльнорыльное":11, "спички":10, "зажигалка":9, \
        "дождевик":8, "фонарик":7, "кот":6, "водка":5, "ноутбук":4, \
        "синхрофазотрон":3, "итератор":2, "фложелет":1}
limit = int(input("Скока кг влезет в ваш рюкзак: "))
result_dict = {}

for item, weight in dict1.items():
    # print(result_dict.get(item) == None)
    if weight <= limit:
        limit -= weight
        result_dict[item] = weight

print("Берём в наш рюкзак:")
for item, weight in result_dict.items():
    print(f'{item} весом {weight} кг')
