"""Погружение в Python (семинары)
Урок 1. Основы Python
1.Решить задачи, которые не успели решить на семинаре.

2.Треугольник существует только тогда, когда сумма любых двух его сторон больше третьей. Дано a, b, c - стороны предполагаемого треугольника. Требуется сравнить длину каждого отрезка-стороны с суммой двух других. Если хотя бы в одном случае отрезок окажется больше суммы двух других, то треугольника с такими сторонами не существует. Отдельно сообщить является ли треугольник разносторонним, равнобедренным или равносторонним.

3. Напишите код, который запрашивает число и сообщает является ли оно простым или составным. Используйте правило для проверки: “Число является простым, если делится нацело только на единицу и на себя”. Сделайте ограничение на ввод отрицательных чисел и чисел больше 100 тысяч. """




# Задача 2 (треугольник)

# Зададим длины сторон треугольника константами
SIDE_A = 5
SIDE_B = 6
SIDE_C = 7

if SIDE_A >= (SIDE_B + SIDE_C):
	print("Сторона треугольника равная " + str(SIDE_A) + ", должна быть меньше суммы длин других сторон (" + str(SIDE_B + SIDE_C) + ") - такого треугольника не существует" )
elif SIDE_B >= (SIDE_A + SIDE_C):
	print("Сторона треугольника равная " + str(SIDE_B) + ", должна быть меньше суммы длин других сторон (" + str(SIDE_A + SIDE_C) + ") - такого треугольника не существует" )
elif SIDE_C >= (SIDE_A + SIDE_B):
	print("Сторона треугольника равная " + str(SIDE_C) + ", должна быть меньше суммы длин других сторон (" + str(SIDE_A + SIDE_B) + ") - такого треугольника не существует" )
else:
	if SIDE_A == SIDE_B and SIDE_A == SIDE_C:
		print("Треугольник равносторонний")
	elif SIDE_A == SIDE_B or SIDE_A == SIDE_C or SIDE_B == SIDE_C:
		print("Треугольник равнобедренный")
	else:
		print("Треугольник РАЗНОсторонний - ни одна сторона не равна другой")
