"""Погружение в Python (семинары)
Урок 1. Основы Python
1.Решить задачи, которые не успели решить на семинаре.

2.Треугольник существует только тогда, когда сумма любых двух его сторон больше третьей. Дано a, b, c - стороны предполагаемого треугольника. Требуется сравнить длину каждого отрезка-стороны с суммой двух других. Если хотя бы в одном случае отрезок окажется больше суммы двух других, то треугольника с такими сторонами не существует. Отдельно сообщить является ли треугольник разносторонним, равнобедренным или равносторонним.

3. Напишите код, который запрашивает число и сообщает является ли оно простым или составным. Используйте правило для проверки: “Число является простым, если делится нацело только на единицу и на себя”. Сделайте ограничение на ввод отрицательных чисел и чисел больше 100 тысяч. """



# Задача 3 (простое/составное число)
""" Задачу думаю решать прямым брутальным способом - сплошным перебором 
делителей. Поскольку многочисленные "умные" теоремы иногда дают 
ложноположительные и ложноотрицательные выводы. Тем более, в условии прямо 
указано, на какое правило проверки опираться. Но при этом, всё таки, не стану 
нагружать процессор лишней работой. Ограничу последовательность делителей 
квадратным корнем из проверяемого числа - больше него нет смысла делить. """

# Зададим лимиты испытуемого числа константами
MIN_LIMIT = 0
MAX_LIMIT = 100000
count = 3
while count > 0:
	print('Попытка ' + str(count))
	count -= 1
	num = int(input('Введи число между ' + str(MIN_LIMIT) + ' и ' +
	str(MAX_LIMIT) + ': '))
	if num < MIN_LIMIT or num > MAX_LIMIT:
		print('Неверно')
	else:
		break
else:
	print('Исчерпаны все попытки. Сожалею.')
	quit()

print('Было введено число ' + str(num) + ', проверим простое оно или составное')

if num < 4:
	print('Число простое')
	quit()

divider = 2
while divider <= round(num**0.5):
	if (num % divider) == 0:
		print('Число составное')
		break
	divider += 1
# 	print(divider)
else:
	print('Число простое')
	