all = ['one_myst', 'myst_serial']


def one_myst(myst:str, answ_lst:list, chanse: int) -> int:
    '''Функция получает на вход загадку, список с возможными вариантами 
    отгадок и количество попыток на угадывание. Программа возвращает номер 
    попытки, с которой была отгадана загадка или ноль, если попытки исчерпаны.'''
    
    print(f'Загадка:   {myst}')
    for i in range(1, chanse+1):
        answer = input('  Введите ваш ответ:  ')
        if answer in answ_lst:
            return i
    return 0


'''1. Добавьте в модуль с загадками функцию, которая хранит словарь списков. 
Ключ словаря - загадка, значение - список с отгадками. Функция в цикле 
вызывает загадывающую функцию, чтобы передать ей все свои загадки.'''
def myst_serial():
    '''Функция хранит словарь списков. Ключ словаря - загадка, значение - 
    список с отгадками. Функция в цикле вызывает загадывающую функцию, чтобы 
    передать ей все свои загадки.'''

    print("Готовы решать загадки?  Приступим!\n")
    myst_dict = {"Зимой и летом одним цветом": ['Елка', 'Ель', 'Елочка'], \
                 "Висит груша нельзя скушать": ['Лампа', 'Лампочка', 'Лампуся'], \
                 "Зубасты, а не кусаются": ['Грабли', 'Грабельки'], \
                 "Весь мир одевает, сама нагишом": ['Игла', 'Иголка', 'Иголочка']}
    general_chance = 3    
    for current_myst in myst_dict.items():
        # print(type(current_myst), current_myst)
        print(one_myst(current_myst[0], \
                    current_myst[1], general_chance), '\n')


if __name__ == '__main__':
    # print(one_myst('Зимой и летом одним цветом', \
    #                ['Елка', 'Ель', 'Елочка'], 5))
    myst_serial()
